Autodesk.Revit.DB.Lighting.LightGroup.GetLights
Get the set of contained light instances
The set of light instances
Since:
2013

Autodesk.Revit.DB.Lighting.LightGroup.RemoveLight(Autodesk.Revit.DB.ElementId)
Remove the given light instance from the set of light instances in this group
lightId:
The light instance to remove
Throws Autodesk.Revit.Exceptions.ArgumentException:
The light instance is not in this LightGroup
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.Lighting.LightGroup.AddLight(Autodesk.Revit.DB.ElementId)
Add a new light instance to the group
lightId:
The ID of the light instance to add to the group
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given element ID does not correspond to a light instance
-or-
The light instance is in this LightGroup
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.Lighting.LightGroup.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Lighting.LightGroup.Id
The ElementId of the LightGroup
Since:
2013

Autodesk.Revit.DB.Lighting.LightGroup.Name
The name of the LightGroup
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: name cannot include prohibited characters.
-or-
When setting this property: The name is not valid because it is not unique within this LightGroupManager
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.Lighting.LightGroup
This class represents a set of lights grouped together for easier management of various lighting scenarios
Since:
2013